update testing scenario and demos
